In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('temperature_data.csv')
print(df.shape)
df.head()

(76009, 9)

,year,city,country,avg_temp,city.1,country.1,year.1,avg_temp.1,global_avg
0,1849,Abidjan,Côte D'Ivoire,7.98,Abidjan,Côte D'Ivoire,1849,7.98,7.98
1,1850,Abidjan,Côte D'Ivoire,7.90,Abidjan,Côte D'Ivoire,1850,7.90,7.90
2,1851,Abidjan,Côte D'Ivoire,8.18,Abidjan,Côte D'Ivoire,1851,8.18,8.18
3,1852,Abidjan,Côte D'Ivoire,8.10,Abidjan,Côte D'Ivoire,1852,8.10,8.10
4,1853,Abidjan,Côte D'Ivoire,8.04,Abidjan,Côte D'Ivoire,1853,8.04,8.04

In [6]:
data = df.drop(['city.1', 'country.1', 'year.1', 'avg_temp.1'], axis=1)
data.head()

   year     city        country  avg_temp  global_avg
0  1849  Abidjan  Côte D'Ivoire      7.98        7.98
1  1850  Abidjan  Côte D'Ivoire      7.90        7.90
2  1851  Abidjan  Côte D'Ivoire      8.18        8.18
3  1852  Abidjan  Côte D'Ivoire      8.10        8.10
4  1853  Abidjan  Côte D'Ivoire      8.04        8.04

In [9]:
data.isin(['New York']).any()

year          False
city           True
country       False
avg_temp      False
global_avg    False
dtype: bool

In [13]:
NY_data = data.loc[data['city'].isin(['New York'])]
print(NY_data.shape)
NY_data.head(20)

(264, 5)

       year      city        country  avg_temp  global_avg
49760  1750  New York  United States      8.72        8.72
49761  1751  New York  United States      7.98        7.98
49762  1752  New York  United States      5.78        5.78
49763  1753  New York  United States      8.39        8.39
49764  1754  New York  United States      8.47        8.47
49765  1755  New York  United States      8.36        8.36
49766  1756  New York  United States      8.85        8.85
49767  1757  New York  United States      9.02        9.02
49768  1758  New York  United States      6.74        6.74
49769  1759  New York  United States      7.99        7.99
49770  1760  New York  United States      7.19        7.19
49771  1761  New York  United States      8.77        8.77
49772  1762  New York  United States      8.61        8.61
49773  1763  New York  United States      7.50        7.50
49774  1764  New York  United States      8.40        8.40
49775  1765  New York  United States      8.25        8.25
49776  1766  New York  United States      8.41        8.41
49777  1767  New York  United States      8.22        8.22
49778  1768  New York  United States      6.78        6.78
49779  1769  New York  United States      7.69        7.69